ТОИР_демо/src/Catalogs/торо_ПараметрыАвтоматическойФиксацииДефектов/торо_ПараметрыАвтоматическойФиксацииДефектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ПараметрыАвтоматическойФиксацииДефектов</name>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьФорму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписыватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаполнениеШапки</name>
    <attributes>
      <name>ШапкаИмяПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШапкаЗначениеПоля</name>
      <type>
        <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
        <types>CatalogRef.Контрагенты</types>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Организации</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШапкаСинонимПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаполнениеТабличнойЧасти</name>
    <attributes>
      <name>ТаблицаИмяПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаЗначениеПоля</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <types>CatalogRef.торо_КритичностьДефекта</types>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
        <types>CatalogRef.торо_ВидыДефектов</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаСинонимПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <enumValues>
    <name>торо_ВыявленныеДефекты</name>
  </enumValues>
  <enumValues>
    <name>торо_АктОВыполненииЭтапаРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланГрафикРемонта</name>
  </enumValues>
  <enumValues>
    <name>торо_ЗаявкаНаРемонт</name>
  </enumValues>
  <enumValues>
    <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ВнешнееОснованиеДляРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_АктПриемкиОборудования</name>
  </enumValues>
  <enumValues>
    <name>торо_ОстановочныеРемонты</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Catalogs/торо_УсловияВыявленияДефекта/торо_УсловияВыявленияДефекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_УсловияВыявленияДефекта</name>
  <predefined>
    <items>
      <name>ПлановыйОсмотр</name>
      <description>Планового осмотра</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_СпособыСогласованияДокументов/торо_СпособыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СпособыСогласованияДокументов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Упр)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСогласования</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замещающие</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОповещаемыеЛица</name>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещаемоеЛицо</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_ВидыДефектов/торо_ВидыДефектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыДефектов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_ПараметрыАвтоматическойФиксацииДефектов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьДоступность();
	УстановитьУсловноеОформление();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.ЗаполнениеШапки.Количество() = 0 И Объект.ЗаполнениеТабличнойЧасти.Количество() = 0 Тогда
		ЗаполнитьТаблицыПолей();
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ Объект.ЗаписыватьДокумент
		И НЕ Объект.ОткрыватьФорму Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для записи объекта выберите действие с документом: открывать или записывать.'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ И Объект.ЗаписыватьДокумент И Объект.ПроводитьДокумент Тогда
		Для Каждого Строка Из Объект.ЗаполнениеШапки Цикл
			Если (Строка.ШапкаИмяПоля = "ДефектВыявленВПроцессе"
				ИЛИ Строка.ШапкаИмяПоля = "Организация"
				ИЛИ Строка.ШапкаИмяПоля = "Подразделение")
				И НЕ ЗначениеЗаполнено(Строка.ШапкаЗначениеПоля) Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Строка Из Объект.ЗаполнениеТабличнойЧасти Цикл
			Если (Строка.ТаблицаИмяПоля = "ВидДефекта"
				ИЛИ Строка.ТаблицаИмяПоля = "ДефектПричина")
				И НЕ ЗначениеЗаполнено(Строка.ТаблицаЗначениеПоля) Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Отказ Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Для записи объекта заполните поля выделенные подчеркиванием или снимите флажок ""Проводить документ"".'"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаписыватьДокументПриИзменении(Элемент)
	Элементы.ПроводитьДокумент.Доступность =  Объект.ЗаписыватьДокумент;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаполнениеШапки

&НаКлиенте
Процедура ЗаполнениеШапкиШапкаЗначениеПоляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ЗаполнениеШапки.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ШапкаИмяПоля	= "Инициатор" Тогда
		
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекДанные.ШапкаЗначениеПоля) Тогда
			Если ТипЗнч(ТекДанные.ШапкаЗначениеПоля) = Тип("СправочникСсылка.Контрагенты") Тогда
				ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",,Элементы.ЗаполнениеШапки,,,,,РежимОткрытияокнаФормы.БлокироватьОкноВладельца);
			ИначеЕсли ТипЗнч(ТекДанные.ШапкаЗначениеПоля) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
				ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаВыбора",,Элементы.ЗаполнениеШапки,,,,,РежимОткрытияокнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
		Иначе
			СписокВыбораТипов = Новый СписокЗначений;
			СписокВыбораТипов.Добавить("Строка");
			СписокВыбораТипов.Добавить("Подразделение");
			СписокВыбораТипов.Добавить("Контрагент");
			СписокВыбораТипов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыбратьИнициатора",ЭтотОбъект,ТекДанные),НСтр("ru = 'Выберите тип'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеШапкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекДанные = Элементы.ЗаполнениеШапки.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ШапкаИмяПоля = "Инициатор" Тогда
		ТекДанные.ШапкаЗначениеПоля = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаполнениеШапкиШапкаСинонимПоля.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаполнениеШапкиШапкаЗначениеПоля.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаполнениеШапкиШапкаИмяПоля.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеШапки.ШапкаИмяПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = "СпособСогласования";

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", торо_Согласования.ПроверитьИспользованиеСогласованияДокументов(Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВыявленныеДефекты));
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаполнениеШапкиШапкаЗначениеПоля.Имя);
	
	ГруппаОтборовЭлемента1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ГруппаОтборовЭлемента2 = ГруппаОтборовЭлемента1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборовЭлемента2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаписыватьДокумент");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтборовЭлемента2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПроводитьДокумент");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ГруппаОтборовЭлемента3 = ГруппаОтборовЭлемента1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаОтборовЭлемента = ГруппаОтборовЭлемента3.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеШапки.ШапкаИмяПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = "ДефектВыявленВПроцессе";
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеШапки.ШапкаЗначениеПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	
	ГруппаОтборовЭлемента = ГруппаОтборовЭлемента3.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеШапки.ШапкаИмяПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = "Организация";
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеШапки.ШапкаЗначениеПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ГруппаОтборовЭлемента = ГруппаОтборовЭлемента3.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеШапки.ШапкаИмяПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = "Подразделение";
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеШапки.ШапкаЗначениеПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаполнениеТабличнойЧастиТаблицаЗначениеПоля.Имя);
	
	ГруппаОтборовЭлемента1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ГруппаОтборовЭлемента2 = ГруппаОтборовЭлемента1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборовЭлемента2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаписыватьДокумент");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтборовЭлемента2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПроводитьДокумент");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ГруппаОтборовЭлемента3 = ГруппаОтборовЭлемента1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;	
	
	ГруппаОтборовЭлемента = ГруппаОтборовЭлемента3.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеТабличнойЧасти.ТаблицаИмяПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = "ДефектПричина";
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеТабличнойЧасти.ТаблицаЗначениеПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ГруппаОтборовЭлемента = ГруппаОтборовЭлемента3.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтборовЭлемента.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеТабличнойЧасти.ТаблицаИмяПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ОтборЭлемента.ПравоеЗначение = "ВидДефекта";
	
	ОтборЭлемента = ГруппаОтборовЭлемента.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаполнениеТабличнойЧасти.ТаблицаЗначениеПоля");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;	
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Истина);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ПроводитьДокумент.Доступность =  Объект.ЗаписыватьДокумент;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыПолей()
	
	ЗаполнениеШапки = Объект.ЗаполнениеШапки;
	НС = ЗаполнениеШапки.Добавить();
	НС.ШапкаИмяПоля		 = "ДефектВыявленВПроцессе";
	НС.ШапкаСинонимПоля  = "Дефект выявлен в процессе";
	НС.ШапкаЗначениеПоля = Справочники.торо_УсловияВыявленияДефекта.ПустаяСсылка();
	
	НС = ЗаполнениеШапки.Добавить();
	НС.ШапкаИмяПоля		 = "Комментарий";
	НС.ШапкаСинонимПоля  = "Комментарий";
	НС.ШапкаЗначениеПоля = "";
	
	НС = ЗаполнениеШапки.Добавить();
	НС.ШапкаИмяПоля		 = "Организация";
	НС.ШапкаСинонимПоля  = "Организация";
	НС.ШапкаЗначениеПоля = Справочники.Организации.ПустаяСсылка();
	
	НС = ЗаполнениеШапки.Добавить();
	НС.ШапкаИмяПоля		 = "Подразделение";
	НС.ШапкаСинонимПоля  = "Подразделение";
	НС.ШапкаЗначениеПоля = Справочники.СтруктураПредприятия.ПустаяСсылка();
	
	НС = ЗаполнениеШапки.Добавить();
	НС.ШапкаИмяПоля		 = "Инициатор";
	НС.ШапкаСинонимПоля  = "Инициатор";
	НС.ШапкаЗначениеПоля = Неопределено;
	
	НС = ЗаполнениеШапки.Добавить();
	НС.ШапкаИмяПоля		 = "Ответственный";
	НС.ШапкаСинонимПоля  = "Ответственный";
	НС.ШапкаЗначениеПоля = Справочники.Пользователи.ПустаяСсылка();
	
	НС = ЗаполнениеШапки.Добавить();
	НС.ШапкаИмяПоля		 = "СпособСогласования";
	НС.ШапкаСинонимПоля  = "Способ согласования";
	НС.ШапкаЗначениеПоля = Справочники.торо_СпособыСогласованияДокументов.ПустаяСсылка();

	
	ЗаполнениеТаблицы = Объект.ЗаполнениеТабличнойЧасти;
	НС = ЗаполнениеТаблицы.Добавить();
	НС.ТаблицаИмяПоля	   = "ВидДефекта";
	НС.ТаблицаСинонимПоля  = "Вид дефекта";
	НС.ТаблицаЗначениеПоля = Справочники.торо_ВидыДефектов.ПустаяСсылка();
	
	НС = ЗаполнениеТаблицы.Добавить();
	НС.ТаблицаИмяПоля	   = "ДефектОписание";
	НС.ТаблицаСинонимПоля  = "Дефект описание";
	НС.ТаблицаЗначениеПоля = "";
	
	НС = ЗаполнениеТаблицы.Добавить();
	НС.ТаблицаИмяПоля	   = "ДефектПричина";
	НС.ТаблицаСинонимПоля  = "Дефект причина";
	НС.ТаблицаЗначениеПоля = Справочники.торо_ПричиныДефектов.ПустаяСсылка();
	
	НС = ЗаполнениеТаблицы.Добавить();
	НС.ТаблицаИмяПоля	   = "НаправлениеНаУстранение";
	НС.ТаблицаСинонимПоля  = "Направление на устранение";
	НС.ТаблицаЗначениеПоля = "";
	
	НС = ЗаполнениеТаблицы.Добавить();
	НС.ТаблицаИмяПоля	   = "ПоследствияДефекта";
	НС.ТаблицаСинонимПоля  = "Последствия дефекта";
	НС.ТаблицаЗначениеПоля = "";
	
	НС = ЗаполнениеТаблицы.Добавить();
	НС.ТаблицаИмяПоля	   = "КритичностьДефекта";
	НС.ТаблицаСинонимПоля  = "Критичность дефекта";
	НС.ТаблицаЗначениеПоля = Справочники.торо_КритичностьДефекта.ПустаяСсылка();
	
	НС = ЗаполнениеТаблицы.Добавить();
	НС.ТаблицаИмяПоля	   = "ТиповойДефект";
	НС.ТаблицаСинонимПоля  = "Типовой дефект";
	НС.ТаблицаЗначениеПоля = Справочники.торо_ТиповыеДефектыОборудования.ПустаяСсылка();
	
	НС = ЗаполнениеТаблицы.Добавить();
	НС.ТаблицаИмяПоля	   = "ПодразделениеИсполнитель";
	НС.ТаблицаСинонимПоля  = "Подразделение-исполнитель";
	НС.ТаблицаЗначениеПоля = Справочники.СтруктураПредприятия.ПустаяСсылка();
	
Конецпроцедуры

&НаКлиенте
Процедура ВыбратьИнициатора(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда
	ИначеЕсли ВыбранныйЭлемент.Значение = "Подразделение" Тогда
		ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаВыбора",,Элементы.ЗаполнениеШапки,,,,,РежимОткрытияокнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ВыбранныйЭлемент.Значение = "Строка" Тогда
		ДополнительныеПараметры.ШапкаЗначениеПоля = "";
	ИначеЕсли ВыбранныйЭлемент.Значение = "Контрагент" Тогда
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",,Элементы.ЗаполнениеШапки,,,,,РежимОткрытияокнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
